{"id": "1", "text": "印刷电路板（PCB）在制造及装配过程中可能产生多种缺陷，常见的包括：划痕、开路、短路、鼠咬、针孔、钻孔错位、铜不足、过刻蚀、欠刻蚀、焊桥、焊锡不足、焊锡过多、通孔空洞、分层、表面污染、纤维暴露、焊盘翘起、起泡、毛刺、裂纹等。"}
{"id": "2", "text": "针对印刷电路板（PCB）划痕缺陷。典型原因有机械接触不当、搬运或夹持过程中的机械应力等。可采取的解决方案：优化搬运与夹持方式、减少机械应力。"}
{"id": "3", "text": "针对印刷电路板（PCB）开路缺陷。典型原因有过刻蚀、线路过细或钻孔偏移导致连接中断等。可采取的解决方案：减少刻蚀强度、优化线路设计及钻孔对位。"}
{"id": "4", "text": "针对印刷电路板（PCB）短路缺陷。典型原因有铜残留、刻蚀不充分或焊锡膏过多等。可采取的解决方案：加强刻蚀控制、清除多余焊锡或铜残留。"}
{"id": "5", "text": "针对印刷电路板（PCB）鼠咬缺陷。典型原因有蚀刻不均、干膜或阻焊附着不良等。可采取的解决方案：优化蚀刻参数、改善干膜或阻焊工艺。"}
{"id": "6", "text": "针对印刷电路板（PCB）针孔缺陷。典型原因有表面污染、电镀过程中气体残留或电镀工艺不稳定等。可采取的解决方案：加强前处理清洗、优化电镀工艺参数。"}
{"id": "7", "text": "针对印刷电路板（PCB）钻孔错位缺陷。典型原因有注册系统误差、定位基准不准或板材尺寸补偿不当等。可采取的解决方案：改善注册系统、优化钻孔定位与补偿参数。"}
{"id": "8", "text": "针对印刷电路板（PCB）铜不足缺陷。典型原因有电镀厚度不足或电镀分布不均等。可采取的解决方案：增加电镀厚度、优化电镀参数。"}
{"id": "9", "text": "针对印刷电路板（PCB）过刻蚀缺陷。典型原因有刻蚀时间过长或刻蚀液浓度过高等。可采取的解决方案：减少刻蚀时间、优化刻蚀液浓度。"}
{"id": "10", "text": "针对印刷电路板（PCB）欠刻蚀缺陷。典型原因有刻蚀时间不足、刻蚀液活性不足或干膜附着不良等。可采取的解决方案：增加刻蚀时间、改善干膜附着性能。"}
{"id": "11", "text": "针对印刷电路板（PCB）焊桥缺陷。典型原因有焊锡膏过多、焊接温度曲线不合理等。可采取的解决方案：减少焊锡膏用量、优化焊接温度曲线。"}
{"id": "12", "text": "针对印刷电路板（PCB）焊锡不足缺陷。典型原因有焊锡膏印刷不足、焊盘氧化或焊接温度不足等。可采取的解决方案：补充焊锡膏、清洁焊盘表面、优化焊接温度。"}
{"id": "13", "text": "针对印刷电路板（PCB）焊锡过多缺陷。典型原因有焊锡膏印刷过量或焊接参数不当等。可采取的解决方案：清除多余焊锡、优化焊接工艺参数。"}
{"id": "14", "text": "针对印刷电路板（PCB）通孔空洞缺陷。典型原因有电镀不充分、孔壁污染或电镀气泡残留等。可采取的解决方案：加强孔壁清洗、优化电镀工艺。"}
{"id": "15", "text": "针对印刷电路板（PCB）分层缺陷。典型原因有层压工艺不良、材料含湿量过高或热应力作用等。可采取的解决方案：改善层压工艺、控制材料含湿量。"}
{"id": "16", "text": "针对印刷电路板（PCB）表面污染缺陷。典型原因有清洗不充分、异物残留或环境污染等。可采取的解决方案：加强清洗流程、改善生产环境。"}
{"id": "17", "text": "针对印刷电路板（PCB）纤维暴露缺陷。典型原因有过刻蚀或基材树脂去除过多等。可采取的解决方案：降低刻蚀强度、优化基材处理工艺。"}
{"id": "18", "text": "针对印刷电路板（PCB）焊盘翘起缺陷。典型原因有热冲击过大或基材结合力不足等。可采取的解决方案：优化焊接温度曲线、改善基材结合性能。"}
{"id": "19", "text": "针对印刷电路板（PCB）起泡缺陷。典型原因有材料吸湿、高温焊接或热应力集中等。可采取的解决方案：控制环境湿度、优化热处理工艺。"}
{"id": "20", "text": "针对印刷电路板（PCB）毛刺缺陷。典型原因有钻头磨损、钻孔参数不当等。可采取的解决方案：更换或锐化钻头、优化钻孔参数。"}
{"id": "21", "text": "针对印刷电路板（PCB）裂纹缺陷。典型原因有机械应力集中或反复热循环等。可采取的解决方案：减少机械应力、优化热管理设计。"}
{"id": "memory_1765877997502", "text": "**PCB焊接后冷却阶段出现裂纹的原因总结**\n\n**核心问题**：焊接过程无异常，但冷却后出现裂纹，主要与**热应力释放**和**材料特性变化**相关。\n\n**关键原因**：\n1. **热应力释放**：焊接时快速升温导致PCB不同材料（基板、铜箔、元器件）因热膨胀系数差异产生内部应力。冷却时材料收缩速率不一致，应力在焊点、过孔等脆弱处集中，超过材料强度引发裂纹。\n2. **材料脆化**：高温焊接后，若冷却过快（如FR-4基材），材料可能因热冲击发生微观结构变化，韧性下降，导致脆性开裂。\n3. **设计/工艺因素**：PCB布局中机械应力集中区域（如尖锐拐角、过孔密集区）或焊接温度曲线设置不当（冷却速率过快），会加剧冷却阶段的应力集中。\n\n**根本机制**：焊接高温积累的热应力在冷却时因材料收缩不均和应力释放而显现裂纹，与热冲击过大或基材结合力不足有关。\n\n**建议措施**：优化焊接温度曲线（控制冷却速率），检查PCB设计以减少应力集中。"}
{"id": "memory_1765889067361", "text": "印刷电路板（PCB）回流焊后板边区域出现裂纹，主要与热应力、机械应力及材料设计因素有关。核心原因包括：  \n1. **热应力集中**：板边散热快或受热不均，导致热梯度大，局部应力集中引发裂纹。  \n2. **机械应力叠加**：分板、搬运等过程造成的边缘微损伤，在回流焊热膨胀下加剧并扩展。  \n3. **材料/设计缺陷**：基材韧性不足、层压结合不良，或板边存在密集钻孔、尖锐转角等应力集中点。  \n\n**建议措施**：优化回流焊温度曲线以均匀加热；改进分板工艺减少边缘损伤；设计时增加板边圆角、避免脆弱结构，并考虑采用高韧性基材。若伴随分层需检查层压工艺。"}
