[
    {
        "id": "1",
        "text": "印刷电路板（PCB）的缺陷类型主要有：划痕、开路、短路、鼠咬、针孔、钻孔错位、铜不足、过刻蚀、欠刻蚀、焊桥、焊锡不足、焊锡过多、通孔空洞、分层、表面污染、纤维暴露、焊盘翘起、起泡、毛刺、裂纹等。"
    },
    {
        "id": "2",
        "text": "针对印刷电路板（PCB）划痕缺陷。典型原因有刻蚀不足、机械应力、材料杂质等。可采取的解决方案：减少机械应力、使用更高纯度材料、减少机械应力（工艺优化）。"
    },
    {
        "id": "3",
        "text": "针对印刷电路板（PCB）开路缺陷。典型原因有过刻蚀过程、钻孔错位等。可采取的解决方案：增加刻蚀时间、优化钻孔对齐。"
    },
    {
        "id": "4",
        "text": "针对印刷电路板（PCB）短路缺陷。典型原因有焊锡膏过多、焊接温度不当等。可采取的解决方案：除去多余焊锡、调整焊接温度。"
    },
    {
        "id": "5",
        "text": "针对印刷电路板（PCB）鼠咬缺陷。典型原因有钻孔错位、钻头条件差等。可采取的解决方案：优化钻孔对齐、更换或锐化钻头。"
    },
    {
        "id": "6",
        "text": "针对印刷电路板（PCB）针孔缺陷。典型原因有钻孔错位、钻头条件差等。可采取的解决方案：优化钻孔对齐、更换或锐化钻头。"
    },
    {
        "id": "7",
        "text": "针对印刷电路板（PCB）钻孔错位缺陷。典型原因有注册不准、曝光能量不当等。可采取的解决方案：改善注册系统、调整曝光能量。"
    },
    {
        "id": "8",
        "text": "针对印刷电路板（PCB）铜不足缺陷。典型原因有镀层厚度不足等。可采取的解决方案：增加镀层厚度。"
    },
    {
        "id": "9",
        "text": "针对印刷电路板（PCB）过刻蚀缺陷。典型原因有过刻蚀过程、曝光能量不当等。可采取的解决方案：减少刻蚀时间、调整曝光能量。"
    },
    {
        "id": "10",
        "text": "针对印刷电路板（PCB）欠刻蚀缺陷。典型原因有刻蚀不足、曝光能量不当、干膜粘附不当等。可采取的解决方案：增加刻蚀时间、增强干膜粘附、调整曝光能量。"
    },
    {
        "id": "11",
        "text": "针对印刷电路板（PCB的）焊桥缺陷。典型原因有焊锡膏过多、焊接温度不当等。可采取的解决方案：除去多余焊锡、调整焊接温度。"
    },
    {
        "id": "12",
        "text": "针对印刷电路板（PCB）焊锡不足缺陷。典型原因有焊锡膏不足、焊接前氧化、焊接温度不当等。可采取的解决方案：重新涂抹焊锡膏、清洁铜表面、调整焊接温度。"
    },
    {
        "id": "13",
        "text": "针对印刷电路板（PCB）焊锡过多缺陷。典型原因有焊锡膏过多、焊接温度不当等。可采取的解决方案：除去多余焊锡、调整焊接温度。"
    },
    {
        "id": "14",
        "text": "针对印刷电路板（PCB）通孔空洞缺陷。典型原因有焊接温度不当、焊接前氧化等。可采取的解决方案：调整焊接温度、清洁铜表面。"
    },
    {
        "id": "15",
        "text": "针对印刷电路板（PCB）分层缺陷。典型原因有层压不良、热应力等。可采取的解决方案：改善层压过程、优化热分布。"
    },
    {
        "id": "16",
        "text": "针对印刷电路板（PCB）表面污染缺陷。典型原因有铜表面污染、清洁不足、表面异物等。可采取的解决方案：清洁铜表面、改善表面清洁、除去表面颗粒。"
    },
    {
        "id": "17",
        "text": "针对印刷电路板（PCB）纤维暴露缺陷。典型原因有过刻蚀过程、材料杂质等。可采取的解决方案：减少刻蚀时间、使用更高纯度材料。"
    },
    {
        "id": "18",
        "text": "针对印刷电路板（PCB）焊盘翘起缺陷。典型原因有层压不良、热应力等。可采取的解决方案：改善层压过程、优化热分布。"
    },
    {
        "id": "19",
        "text": "针对印刷电路板（PCB）起泡缺陷。典型原因有高湿度环境、热应力等。可采取的解决方案：环境湿度控制、优化热分布。"
    },
    {
        "id": "20",
        "text": "针对印刷电路板（PCB）毛刺缺陷。典型原因有钻头条件差、材料杂质等。可采取的解决方案：更换或锐化钻头、使用更高纯度材料。"
    },
    {
        "id": "21",
        "text": "针对印刷电路板（PCB）裂纹缺陷。典型原因有机械应力、热应力等。可采取的解决方案：减少机械应力、优化热分布。"
    }
]